# Running models and cross validation

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from termcolor import colored
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split, GridSearchCV, cross_val_score, KFold
from sklearn import metrics

C:\Users\luisf\AppData\Local\Temp\ipykernel_13560\4088898045.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
#Time series split
from sklearn.model_selection import TimeSeriesSplit
from sklearn.metrics import mean_squared_error
import statsmodels.api as sm

In [ ]:
df = pd.read_csv('')

In [ ]:
# Separating features and target variable
X = df(['Price'], axis=1)
y = df['Price']

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

## Cross validation

In [ ]:
tscv = TimeSeriesSplit(n_splits=5)

Iterate through cross validation

In [ ]:
for train_index, test_index in tscv.split(data):
    train_data, test_data = data.iloc[train_index], data.iloc[test_index]

Create the dataframe

In [18]:
df1 = pd.read_csv('merged_luisfer.CSV')
df2 = pd.read_csv('merged_isabella.csv')
df3 = pd.read_csv('merged_camilo.csv', index_col=False)

In [19]:
df1

,Unnamed: 0,Date,Solar,Wind Onshore,country_index,Wind Offshore
0,0,2015-01-01 00:00:00+01:00,0.0,118.0,AT,NaN
1,1,2015-01-01 00:15:00+01:00,0.0,118.0,AT,NaN
2,2,2015-01-01 00:30:00+01:00,0.0,117.0,AT,NaN
3,3,2015-01-01 00:45:00+01:00,0.0,116.0,AT,NaN
4,4,2015-01-01 01:00:00+01:00,0.0,146.0,AT,NaN
...,...,...,...,...,...,...
705207,78611,2023-12-30 19:00:00+01:00,0.0,665.0,DK_1,570.0
705208,78612,2023-12-30 20:00:00+01:00,0.0,466.0,DK_1,452.0
705209,78613,2023-12-30 21:00:00+01:00,0.0,323.0,DK_1,352.0
705210,78614,2023-12-30 22:00:00+01:00,0.0,227.0,DK_1,315.0
705211,78615,2023-12-30 23:00:00+01:00,0.0,184.0,DK_1,362.0

In [20]:
df2

,Unnamed: 0,Date,Solar,Wind Onshore,country_index,Wind Offshore
0,0,2015-01-01 00:00:00+01:00,0.0,NaN,IT_SARD,NaN
1,1,2015-01-01 01:00:00+01:00,0.0,NaN,IT_SARD,NaN
2,2,2015-01-01 02:00:00+01:00,0.0,NaN,IT_SARD,NaN
3,3,2015-01-01 03:00:00+01:00,0.0,NaN,IT_SARD,NaN
4,4,2015-01-01 04:00:00+01:00,0.0,NaN,IT_SARD,NaN
...,...,...,...,...,...,...
1048570,76801,2023-10-08 16:00:00+02:00,0.0,89.0,NO_4,NaN
1048571,76802,2023-10-08 17:00:00+02:00,0.0,83.0,NO_4,NaN
1048572,76803,2023-10-08 18:00:00+02:00,0.0,76.0,NO_4,NaN
1048573,76804,2023-10-08 19:00:00+02:00,0.0,74.0,NO_4,NaN
1048574,76805,2023-10-08 20:00:00+02:00,0.0,75.0,NO_4,NaN

In [21]:
df3

,Unnamed: 0,Date,Solar,Wind Offshore,country_index,Wind Onshore
0,0,2015-01-07 00:00:00+01:00,0.0,316.0,DK_2,267.0
1,1,2015-01-07 01:00:00+01:00,0.0,302.0,DK_2,235.0
2,2,2015-01-07 02:00:00+01:00,0.0,269.0,DK_2,204.0
3,3,2015-01-07 03:00:00+01:00,0.0,234.0,DK_2,173.0
4,4,2015-01-07 04:00:00+01:00,0.0,182.0,DK_2,142.0
...,...,...,...,...,...,...
1048570,58440,2021-09-01 07:00:00+02:00,65.0,NaN,IT_CNOR,3.0
1048571,58441,2021-09-01 08:00:00+02:00,271.0,NaN,IT_CNOR,4.0
1048572,58442,2021-09-01 09:00:00+02:00,509.0,NaN,IT_CNOR,4.0
1048573,58443,2021-09-01 10:00:00+02:00,684.0,NaN,IT_CNOR,6.0
1048574,58444,2021-09-01 11:00:00+02:00,784.0,NaN,IT_CNOR,3.0

In [22]:
print(df1.shape)
print(df2.shape)
print(df3.shape)

(705212, 6)
(1048575, 6)
(1048575, 6)

In [23]:
df_concatenated = pd.concat([df1, df2, df3], ignore_index=True)

In [24]:
df_concatenated

,Unnamed: 0,Date,Solar,Wind Onshore,country_index,Wind Offshore
0,0,2015-01-01 00:00:00+01:00,0.0,118.0,AT,NaN
1,1,2015-01-01 00:15:00+01:00,0.0,118.0,AT,NaN
2,2,2015-01-01 00:30:00+01:00,0.0,117.0,AT,NaN
3,3,2015-01-01 00:45:00+01:00,0.0,116.0,AT,NaN
4,4,2015-01-01 01:00:00+01:00,0.0,146.0,AT,NaN
...,...,...,...,...,...,...
2802357,58440,2021-09-01 07:00:00+02:00,65.0,3.0,IT_CNOR,NaN
2802358,58441,2021-09-01 08:00:00+02:00,271.0,4.0,IT_CNOR,NaN
2802359,58442,2021-09-01 09:00:00+02:00,509.0,4.0,IT_CNOR,NaN
2802360,58443,2021-09-01 10:00:00+02:00,684.0,6.0,IT_CNOR,NaN
2802361,58444,2021-09-01 11:00:00+02:00,784.0,3.0,IT_CNOR,NaN

In [27]:
print(df_concatenated.head())

   Unnamed: 0                       Date  Solar  Wind Onshore country_index  \
0           0  2015-01-01 00:00:00+01:00    0.0         118.0            AT
1           1  2015-01-01 00:15:00+01:00    0.0         118.0            AT
2           2  2015-01-01 00:30:00+01:00    0.0         117.0            AT
3           3  2015-01-01 00:45:00+01:00    0.0         116.0            AT
4           4  2015-01-01 01:00:00+01:00    0.0         146.0            AT

   Wind Offshore
0            NaN
1            NaN
2            NaN
3            NaN
4            NaN

In [26]:
print(df_concatenated.tail())

         Unnamed: 0                       Date  Solar  Wind Onshore  \
2802357       58440  2021-09-01 07:00:00+02:00   65.0           3.0
2802358       58441  2021-09-01 08:00:00+02:00  271.0           4.0
2802359       58442  2021-09-01 09:00:00+02:00  509.0           4.0
2802360       58443  2021-09-01 10:00:00+02:00  684.0           6.0
2802361       58444  2021-09-01 11:00:00+02:00  784.0           3.0

        country_index  Wind Offshore
2802357       IT_CNOR            NaN
2802358       IT_CNOR            NaN
2802359       IT_CNOR            NaN
2802360       IT_CNOR            NaN
2802361       IT_CNOR            NaN

In [28]:
df_concatenated.to_csv('all_merged.csv', index=False)

Now we're missing merging all the dataframe

In [29]:
df4 = pd.read_csv('all_merged.csv')

In [30]:
df4

,Unnamed: 0,Date,Solar,Wind Onshore,country_index,Wind Offshore
0,0,2015-01-01 00:00:00+01:00,0.0,118.0,AT,NaN
1,1,2015-01-01 00:15:00+01:00,0.0,118.0,AT,NaN
2,2,2015-01-01 00:30:00+01:00,0.0,117.0,AT,NaN
3,3,2015-01-01 00:45:00+01:00,0.0,116.0,AT,NaN
4,4,2015-01-01 01:00:00+01:00,0.0,146.0,AT,NaN
...,...,...,...,...,...,...
2802357,58440,2021-09-01 07:00:00+02:00,65.0,3.0,IT_CNOR,NaN
2802358,58441,2021-09-01 08:00:00+02:00,271.0,4.0,IT_CNOR,NaN
2802359,58442,2021-09-01 09:00:00+02:00,509.0,4.0,IT_CNOR,NaN
2802360,58443,2021-09-01 10:00:00+02:00,684.0,6.0,IT_CNOR,NaN
2802361,58444,2021-09-01 11:00:00+02:00,784.0,3.0,IT_CNOR,NaN

In [ ]:
df5 =